## Pandas

### DataFrame

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [38]:
# example
import pandas as pd
import numpy as np

In [43]:
df = pd.DataFrame([[10,20,30],[22,56,78],[4,8,2],[23,67,45]])

In [44]:
df

    0   1   2
0  10  20  30
1  22  56  78
2   4   8   2
3  23  67  45

syntax:
    
    df[column][index]

In [46]:
df[1]

0    20
1    56
2     8
3    67
Name: 1, dtype: int64

In [48]:
df[2][1]

78

In [49]:
df

    0   1   2
0  10  20  30
1  22  56  78
2   4   8   2
3  23  67  45

In [50]:
#df[start:end-1:step]

df[:]

    0   1   2
0  10  20  30
1  22  56  78
2   4   8   2
3  23  67  45

In [54]:


df[1:2]

    0   1   2
1  22  56  78

In [55]:
#example

df

    0   1   2
0  10  20  30
1  22  56  78
2   4   8   2
3  23  67  45

In [58]:
df[:]

    0   1   2
0  10  20  30
1  22  56  78
2   4   8   2
3  23  67  45

In [59]:
df[1][2]

8

In [60]:
#direct replace

df[1][2]=100

In [61]:
df

    0    1   2
0  10   20  30
1  22   56  78
2   4  100   2
3  23   67  45

rename->index,columns
replace->values

In [ ]:
# rename columns

In [64]:
df.columns=['col1','col2','col3']

In [65]:
df

   col1  col2  col3
0    10    20    30
1    22    56    78
2     4   100     2
3    23    67    45

In [ ]:
# rename index

In [69]:
df.index=['l1','l2','l3','l4']

In [70]:
df

    col1  col2  col3
l1    10    20    30
l2    22    56    78
l3     4   100     2
l4    23    67    45

### Rename()

#syntax

variable_name.rename({old_index/column:new_index/column,old_index/column:new_index/column},inplace=True)

In [72]:
df

    col1  col2  col3
l1    10    20    30
l2    22    56    78
l3     4   100     2
l4    23    67    45

In [74]:
#example

df.rename({'col2':'new_col'},axis=1)

    col1  new_col  col3
l1    10       20    30
l2    22       56    78
l3     4      100     2
l4    23       67    45

In [75]:
df.rename({'l3':'new_l3'},axis=0)

        col1  col2  col3
l1        10    20    30
l2        22    56    78
new_l3     4   100     2
l4        23    67    45

#### Replace()

In [ ]:
# replace only one value

variable_name.replace(old_value,new_value,inplace=True)

In [ ]:
# replace multiple values

variable_name.replace([old_value1,old_value2,old_value3],[new_value1,new_value2,new_value3],inplace=True)

In [76]:
df

    col1  col2  col3
l1    10    20    30
l2    22    56    78
l3     4   100     2
l4    23    67    45

### head()

In [80]:
df.head(1)

    col1  col2  col3
l1    10    20    30

### tail()

In [81]:
df

    col1  col2  col3
l1    10    20    30
l2    22    56    78
l3     4   100     2
l4    23    67    45

In [82]:
df.tail(2)

    col1  col2  col3
l3     4   100     2
l4    23    67    45

### info()

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, l1 to l4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      int64
dtypes: int64(3)
memory usage: 300.0+ bytes

### describe()

In [85]:
df

    col1  col2  col3
l1    10    20    30
l2    22    56    78
l3     4   100     2
l4    23    67    45

In [84]:
df.describe()

            col1        col2       col3
count   4.000000    4.000000   4.000000
mean   14.750000   60.750000  38.750000
std     9.287088   32.978528  31.658332
min     4.000000   20.000000   2.000000
25%     8.500000   47.000000  23.000000
50%    16.000000   61.500000  37.500000
75%    22.250000   75.250000  53.250000
max    23.000000  100.000000  78.000000

In [ ]:
#mean=average

### sample()

In [86]:
df

    col1  col2  col3
l1    10    20    30
l2    22    56    78
l3     4   100     2
l4    23    67    45

In [97]:
df.sample(3)

    col1  col2  col3
l3     4   100     2
l4    23    67    45
l2    22    56    78

### indexing

- loc --> label based indexing
- iloc -->integer based indexing

#### iloc

In [31]:
# d1.iloc[:,:]

### loc

### read_csv()

In [ ]:
- head()
- tail()
- sample()
- info()
- describe()
-

### duplicated()

In [35]:
# df1.duplicated(subset=['sub6'])

### drop_duplicates()